In [5]:
import pandas as pd
import numpy as np

rng = np.random.RandomState(41)

In [6]:

pd.__version__

'1.1.4'

### The Basics

In [16]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                  'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                        'New York': 19651127}, name='population')

population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [17]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [22]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                 columns=list('AB'))
A

    A   B
0  10  13
1  10  18

In [23]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                 columns=list('BAC'))
B

   B  A  C
0  0  1  7
1  2  2  8
2  2  5  2

In [24]:
A+B

      A     B   C
0  11.0  13.0 NaN
1  12.0  20.0 NaN
2   NaN   NaN NaN

In [27]:
A

    A   B
0  10  13
1  10  18

In [28]:
A.stack().mean()

12.75

In [29]:
A.mean()

A    10.0
B    15.5
dtype: float64

In [30]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
0  11.00  13.00  19.75
1  12.00  20.00  20.75
2  17.75  14.75  14.75

In [37]:
1e6

1000000.0

In [38]:
1E6

1000000.0

### Multi Indexing

In [78]:
data = {('California', 2000): 33871648,
        ('California', 2010): 37253956,
        ('Texas', 2000): 20851820,
        ('Texas', 2010): 25145561,
        ('New York', 2000): 18976457,
        ('New York', 2010): 19378102}
df = pd.Series(data, name='population').to_frame()

In [79]:
df

                 population
California 2000    33871648
           2010    37253956
Texas      2000    20851820
           2010    25145561
New York   2000    18976457
           2010    19378102

In [80]:
df.unstack()

           population
                 2000      2010
California   33871648  37253956
New York     18976457  19378102
Texas        20851820  25145561

In [82]:
df.index.names = ['state', 'year']

In [83]:
df

                 population
state      year
California 2000    33871648
           2010    37253956
Texas      2000    20851820
           2010    25145561
New York   2000    18976457
           2010    19378102

In [89]:
df[df>22000000].dropna()

                 population
state      year
California 2000  33871648.0
           2010  37253956.0
Texas      2010  25145561.0

In [60]:
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=['data1', 'data2'])
df

        data1     data2
a 1  0.988551  0.417995
  2  0.912059  0.137127
b 1  0.184565  0.727092
  2  0.888260  0.726647

In [62]:
(df.data1/df.data2).unstack()

          1         2
a  2.364982  6.651204
b  0.253840  1.222410